


MMUSIC WG                                               M. Garcia-Martin
Internet-Draft                                                  Ericsson
Intended status: Standards Track                         S. Veikkolainen
Expires: February 23, 2012                                         Nokia
                                                         August 22, 2011


 Session Description Protocol (SDP) Extension For Setting Up Audio and
    Video Media Streams Over Circuit-Switched Bearers In  The Public
                   Switched Telephone Network (PSTN)
                      draft-ietf-mmusic-sdp-cs-07

Abstract

   This memo describes use cases, requirements, and protocol extensions
   for using the Session Description Protocol (SDP) Offer/Answer model
   for establishing audio and video media streams over circuit-switched
   bearers in the Public Switched Telephone Network (PSTN).

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on February 23, 2012.

Copyright Notice

   Copyright (c) 2011 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of



Garcia-Martin & Veikkolainen  Expires February 23, 2012         [Page 1]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

   This document may contain material from IETF Documents or IETF
   Contributions published or made publicly available before November
   10, 2008.  The person(s) controlling the copyright in some of this
   material may not have granted the IETF Trust the right to allow
   modifications of such material outside the IETF Standards Process.
   Without obtaining an adequate license from the person(s) controlling
   the copyright in such materials, this document may not be modified
   outside the IETF Standards Process, and derivative works of it may
   not be created outside the IETF Standards Process, except to format
   it for publication as an RFC or to translate it into languages other
   than English.





































Garcia-Martin & Veikkolainen  Expires February 23, 2012         [Page 2]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
   2.  Conventions Used in This Document  . . . . . . . . . . . . . .  5
   3.  Requirements . . . . . . . . . . . . . . . . . . . . . . . . .  5
   4.  Overview of Operation  . . . . . . . . . . . . . . . . . . . .  6
     4.1.  Example Call Flow  . . . . . . . . . . . . . . . . . . . .  6
   5.  Protocol Description . . . . . . . . . . . . . . . . . . . . .  8
     5.1.  Level of Compliance  . . . . . . . . . . . . . . . . . . .  8
     5.2.  Extensions to SDP  . . . . . . . . . . . . . . . . . . . .  8
       5.2.1.  Connection Data  . . . . . . . . . . . . . . . . . . .  8
       5.2.2.  Media Descriptions . . . . . . . . . . . . . . . . . .  9
       5.2.3.  Correlating the PSTN Circuit-Switched Bearer with
               SDP  . . . . . . . . . . . . . . . . . . . . . . . . . 10
         5.2.3.1.  The "cs-correlation" attribute . . . . . . . . . . 11
         5.2.3.2.  Caller-ID Correlation Mechanism  . . . . . . . . . 11
         5.2.3.3.  User-User Information Element Correlation
                   Mechanism  . . . . . . . . . . . . . . . . . . . . 12
         5.2.3.4.  DTMF Correlation Mechanism . . . . . . . . . . . . 13
     5.3.  Negotiating the correlation mechanisms . . . . . . . . . . 14
       5.3.1.  Determining the Direction of the Circuit-Switched
               Connection Setup . . . . . . . . . . . . . . . . . . . 14
       5.3.2.  Offerer behaviour  . . . . . . . . . . . . . . . . . . 16
       5.3.3.  Answerer behaviour . . . . . . . . . . . . . . . . . . 17
       5.3.4.  Considerations on successful correlation . . . . . . . 19
     5.4.  Considerations for Usage of Existing SDP . . . . . . . . . 19
       5.4.1.  Originator of the Session  . . . . . . . . . . . . . . 19
       5.4.2.  Contact information  . . . . . . . . . . . . . . . . . 20
     5.5.  Formal Syntax  . . . . . . . . . . . . . . . . . . . . . . 20
   6.  Example  . . . . . . . . . . . . . . . . . . . . . . . . . . . 21
   7.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 22
     7.1.  Registration of new correlation SDP attribute  . . . . . . 22
     7.2.  Registration of a new "nettype" value  . . . . . . . . . . 23
     7.3.  Registration of new "addrtype" values  . . . . . . . . . . 23
     7.4.  Registration of a new "proto" value  . . . . . . . . . . . 23
   8.  Security Considerations  . . . . . . . . . . . . . . . . . . . 23
   9.  Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 24
   10. References . . . . . . . . . . . . . . . . . . . . . . . . . . 24
     10.1. Normative References . . . . . . . . . . . . . . . . . . . 24
     10.2. Informative References . . . . . . . . . . . . . . . . . . 24
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 25










Garcia-Martin & Veikkolainen  Expires February 23, 2012         [Page 3]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


1.  Introduction

   The Session Description Protocol (SDP) [RFC4566] is intended for
   describing multimedia sessions for the purposes of session
   announcement, session invitation, and other forms of multimedia
   session initiation.  SDP is most commonly used for describing media
   streams that are transported over the Real-Time Transport Protocol
   (RTP) [RFC3550], using the profiles for audio and video media defined
   in RTP Profile for Audio and Video Conferences with Minimal Control
   [RFC3551].

   However, SDP can be used to describe other transport protocols than
   RTP.  Previous work includes SDP conventions for describing ATM
   bearer connections [RFC3108] and the Message Session Relay Protocol
   [RFC4975].

   SDP is commonly carried in Session Initiation Protocol (SIP)
   [RFC3261] messages in order to agree on a common media description
   among the endpoints.  An Offer/Answer Model with Session Description
   Protocol (SDP) [RFC3264] defines a framework by which two endpoints
   can exchange SDP media descriptions and come to an agreement as to
   which media streams should be used, along with the media related
   parameters.

   In some scenarios it might be desirable to establish the media stream
   over a circuit-switched bearer connection even if the signaling for
   the session is carried over an IP bearer.  An example of such a
   scenario is illustrated with two mobile devices capable of both
   circuit-switched and packet-switched communication over a low-
   bandwidth radio bearer.  The radio bearer may not be suitable for
   carrying real-time audio or video media, and using a circuit-switched
   bearer would offer a better perceived quality of service.  So,
   according to this scenario, SDP and its higher layer session control
   protocol (e.g., the Session Initiation Protocol (SIP) [RFC3261]) are
   used over regular IP connectivity, while the audio or video is
   received through the classical circuit-switched bearer.

   Setting up a signaling relationship in the IP domain instead of just
   setting up a circuit-switched call offers also the possibility of
   negotiating in the same session other IP based media that is not
   sensitive to jitter and delay, for example, text messaging or
   presence information.

   At a later point in time the mobile device might move to an area
   where a high-bandwidth packet-switched bearer, for example a Wireless
   Local Area Network (WLAN) connection, is available.  At this point
   the mobile device may perform a handover and move the audio or video
   media streams over to the high-speed bearer.  This implies a new



Garcia-Martin & Veikkolainen  Expires February 23, 2012         [Page 4]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   exchange of SDP Offer/Answer that lead to a re-negotiation of the
   media streams.

   Other use cases exist.  For example, and endpoint might have at its
   disposal circuit-switched and packet-switched connectivity, but the
   same audio or video codecs are not feasible for both access networks.
   For example, the circuit-switched audio or video stream supports
   narrow-bandwidth codecs, while the packet-switched access allows any
   other audio or video codec implemented in the endpoint.  In this
   case, it might be beneficial for the endpoint to describe different
   codecs for each access type and get an agreement on the bearer
   together with the remote endpoint.

   There are additional use cases related to third party call control
   where the session setup time is improved when the circuit-switched
   bearer in the PSTN is described together with one or more codecs.

   The rest of the document is structured as follows: Section 2 provides
   the document conventions, Section 3 introduces the requirements,
   Section 4 presents an overview of the proposed solutions, and
   Section 5 contains the protocol description.  Section 6 provides an
   example of descriptions of circuit-switched audio or video streams in
   SDP.  Section 7 and Section 8 contain the IANA and Security
   considerations, respectively.


2.  Conventions Used in This Document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in BCP 14, RFC 2119
   [RFC2119] and indicate requirement levels for compliant
   implementations.


3.  Requirements

   This section presents the general requirements that are specific for
   the audio or video media streams over circuit-switched bearers.

   REQ-1:  A mechanism for endpoints to negotiate and agree on an audio
           or video media stream established over a circuit-switched
           bearer MUST be available.

   REQ-2:  The mechanism MUST allow the endpoints to combine circuit-
           switched audio or video media streams with other
           complementary media streams, for example, text messaging.




Garcia-Martin & Veikkolainen  Expires February 23, 2012         [Page 5]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   REQ-3:  The mechanism MUST allow the endpoint to negotiate the
           direction of the circuit-switched connection, i.e., which
           endpoint is active when initiating the circuit-switched
           connection.

   REQ-4:  The mechanism MUST be independent of the type of the circuit-
           switched access (e.g., Integrated Services Digital Network
           (ISDN), Global System for Mobile Communication (GSM), etc.)

   REQ-5:  There MUST be a mechanism that helps an endpoint to correlate
           an incoming circuit-switched bearer with the one negotiated
           in SDP, as opposed to another incoming call that is not
           related to that.

   REQ-6:  It MUST be possible for endpoints to advertise different list
           of audio or video codecs in the circuit-switched audio or
           video stream from those used in a packet-switched audio or
           video stream.

   REQ-7:  It MUST be possible for endpoints to not advertise the list
           of available codecs for circuit-switched audio or video
           streams.


4.  Overview of Operation

   The mechanism defined in this memo extends SDP and allows describing
   an audio or video media stream established over a circuit-switched
   bearer.  New tokens are registered in the "c=" and "m=" lines to be
   able to describe a media stream over a circuit-switched bearer.
   These SDP extensions are described in Section 5.2.  Since circuit-
   switched bearers are connection-oriented media streams, the mechanism
   re-uses the connection-oriented extensions defined in RFC 4145
   [RFC4145] to negotiate the active and passive sides of a connection
   setup.  This is further described in Section 5.3.1.

4.1.  Example Call Flow

   Consider the example presented in Figure 1.  In this example, Alice
   is located in an environment where she has access to both IP and
   circuit-switched bearers for communicating with other endpoints.
   Alice decides that the circuit-switched bearer offers a better
   perceived quality of service for voice, and issues an SDP Offer
   containing the description of an audio media stream over circuit-
   switched bearer.






Garcia-Martin & Veikkolainen  Expires February 23, 2012         [Page 6]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


                  Alice                                 Bob
                    | (1) SDP Offer (PSTN audio)         |
                    |----------------------------------->|
                    |                                    |
                    | (2) SDP Answer (PSTN audio)        |
                    |<-----------------------------------|
                    |                                    |
                    |   PSTN call setup                  |
                    |<-----------------------------------|
                    |                                    |
                    |                                    |
                    |<===== media over PSTN bearer =====>|
                    |                                    |

                          Figure 1: Example Flow

   Bob receives the SDP offer and determines that he is located in an
   environment where the IP based bearer is not suitable for real-time
   audio media.  However he also has PSTN circuit-switched bearer
   available for audio.  Bob generates an SDP answer containing a
   description of the audio media stream over a circuit-switched bearer.

   During the offer-answer exchange Alice and Bob also agree the
   direction in which the circuit-switched connection should be
   established.  In this example, Bob becomes the active party, in other
   words, he establishes the circuit-switched call to the other
   endpoint.  The Offer/Answer exchange contains identifiers or
   references that can be used on the circuit-switched network for
   addressing the other endpoint, as well as information that is used to
   determine that the incoming circuit-switched bearer establishment is
   related to the ongoing session between Alice and Bob.

   Bob establishes a circuit-switched bearer towards Alice using
   whatever mechanisms are defined for the network type in question.
   When receiving the incoming circuit-switched connection attempt,
   Alice is able to determine that the attempt is related to the session
   she is just establishing with Bob.

   Alice accepts the circuit-switched connection; the circuit-switched
   bearer setup is completed.  Bob and Alice can now use the circuit-
   switched connection for two-way audio media.

   If, for some reason, Bob would like to reject the offered stream, he
   would set the port number of the specific stream to zero, as
   specified in RFC3264 [RFC3264].  Also, if Bob does not understand
   some of the SDP attributes specified in this document, he would
   ignore them, as specified in RFC4566 [RFC4566].




Garcia-Martin & Veikkolainen  Expires February 23, 2012         [Page 7]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


5.  Protocol Description

5.1.  Level of Compliance

   Implementations according to this specification MUST implement the
   SDP extensions described in Section 5.2, and MUST implement the
   considerations discussed in Section 5.3 and Section 5.4.

5.2.  Extensions to SDP

   This section provides the syntax and semantics of the extensions
   required for providing a description of audio or video media streams
   over circuit-switched bearers in SDP.

5.2.1.  Connection Data

   According to SDP [RFC4566], the connection data line in SDP has the
   following syntax:

      c=<nettype> <addrtype> <connection-address>

   where <nettype> indicates the network type, <addrtype> indicates the
   address type, and the <connection-address> is the connection address,
   which is dependent on the address type.

   At the moment, the only network type defined is "IN", which indicates
   Internet network type.  The address types "IP4" and "IP6" indicate
   the type of IP addresses.

   This memo defines a new network type for describing a circuit-
   switched bearer network type in the PSTN.  The mnemonic "PSTN" is
   used for this network type.

   For the address type, we initially consider the possibility of
   describing E.164 telephone numbers.  We define a new "E164" address
   type.  When used, the "E164" address type indicates that the
   connection address contains a telephone number represented according
   to the ITU-T E.164 [ITU.E164.1991] recommendation.

   There are cases, though, when the endpoint is merely aware of a
   circuit-switched bearer, without having further information about the
   address type or the E.164 number allocated to it.  In these cases a
   dash "-" is used to indicate an unknown address type or connection
   address.  This makes the connection data line be according to the SDP
   syntax.






Garcia-Martin & Veikkolainen  Expires February 23, 2012         [Page 8]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


      Note that <addrtype> and/or <connection-address> should not be
      omitted without being set to a "-" since this would violate basic
      syntax of SDP [RFC4566].

   The following are examples of the extension to the connection data
   line:

      c=PSTN E164 +15551234

      c=PSTN - -

5.2.2.  Media Descriptions

   According to SDP [RFC4566], the media descriptions line in SDP has
   the following syntax:

      m=<media> <port> <proto> <fmt> ...

   The <media> sub-field carries the media type.  For establishing an
   audio bearer, the existing "audio" media type is used.  For
   establishing a video bearer, the existing "video" media type is used.

   The <port> sub-field is the transport port to which the media stream
   is sent.  Circuit-switched access lacks the concept of a port number,
   and therefore the <port> sub-field is set to the discard port "9".

   According to RFC 3264 [RFC3264], a port number of zero in the offer
   of a unicast stream indicates that the stream is offered but must not
   be used.  If a port number of zero is present in the answer of a
   unicast stream, it indicates that the stream is rejected.  These
   rules are still valid when the media line in SDP represents a
   circuit-switched bearer.

   The <proto> sub-field is the transport protocol.  The circuit-
   switched bearer uses whatever transport protocol it has available.
   This subfield SHOULD be set to the mnemonic "PSTN" to be
   syntactically correct with SDP [RFC4566] and to indicate the usage of
   circuit-switched protocols in the PSTN.

   The <fmt> sub-field is the media format description.  In the
   classical usage of SDP to describe RTP-based media streams, when the
   <proto> sub-field is set to "RTP/AVP" or "RTP/SAVP", the <fmt> sub-
   field contains the payload types as defined in the RTP audio profile
   [RFC3551].

   When "RTP/AVP" is used in the <proto> field, the <fmt> sub-field
   contains the RTP payload type numbers.  We use the <fmt> sub-field to
   indicate the list of available codecs over the circuit-switched



Garcia-Martin & Veikkolainen  Expires February 23, 2012         [Page 9]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   bearer, by re-using the conventions and payload type numbers defined
   for RTP/AVP.  The RTP audio and video media types, which, when
   applied to PSTN circuit-switched bearers, represent merely an audio
   or video codec.

   In some cases, the endpoint is not able to determine the list of
   available codecs for circuit-switched media streams.  In this case,
   in order to be syntactically compliant with SDP [RFC4566], the
   endpoint MUST include a single dash "-" in the <fmt> sub-field.

   As per RFC 4566 [RFC4566], the media format descriptions are listed
   in priority order.

   Examples of media descriptions for circuit-switched audio streams
   are:

      m=audio 9 PSTN 3 0 8

      m=audio 9 PSTN -

   Similarly, an example of a media description for circuit-switched
   video stream is:

      m=video 9 PSTN 34

      m=video 9 PSTN -

5.2.3.  Correlating the PSTN Circuit-Switched Bearer with SDP

   The endpoints should be able to correlate the circuit-switched bearer
   with the session negotiated with SDP in order to avoid ringing for an
   incoming circuit-switched bearer that is related to the session
   controlled with SDP (and SIP).

   Several alternatives exist for performing this correlation.  This
   memo provides three mutually non-exclusive correlation mechanisms.
   Other correlation mechanisms may exist, and their usage will be
   specified when need arises.  All mechanisms share the same principle:
   some unique information is sent in the SDP and in the circuit-
   switched signaling protocol.  If these pieces of information match,
   then the circuit-switched bearer is part of the session described in
   the SDP exchange.  Otherwise, there is no guarantee that the circuit-
   switched bearer is related to such session.

   The first mechanism is based on the exchange of PSTN caller-ID
   between the endpoints.  The caller-ID is also available as the
   Calling Party ID in the circuit-switched signaling.




Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 10]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   The second mechanism is based on the inclusion in SDP of a value that
   is also sent in the User-to-User Information Element that is part of
   the bearer setup signaling in the PSTN.

   The third mechanism is based on sending in SDP a string that
   represents Dual Tone MultiFrequency (DTMF) digits that will be later
   sent right after the circuit-switched bearer is established.
   Implementations MAY use any of these mechanisms and MAY use two or
   more mechanisms simultaneously.

5.2.3.1.  The "cs-correlation" attribute

   In order to provide support for the correlation mechanisms, we define
   a new SDP attribute called "cs-correlation".  This "cs-correlation"
   attribute can include any of the "callerid", "uuie", or "dtmf" sub-
   fields, which specify additional information required by the
   Caller-ID, User to User Information, or DTMF correlation mechanisms,
   respectively.  The list of correlation mechanisms may be extended by
   other specifications.

   The following sections provide more detailed information of these
   subfields.  The "cs-correlation" attribute has the following format:


   a=cs-correlation: callerid:<callerid-value> |
                     uuie:<uuie-value>           |
                     dtmf:<dtmf-value>           |
                     [extension-name:<extension-value>]

   The values "callerid", "uuie" and "dtmf" refer to the correlation
   mechanisms defined in Section 5.2.3.2, Section 5.2.3.3, and
   Section 5.2.3.4, respectively.  The formal Augmented Backus-Naur
   Format (ABNF) syntax of the "cs-correlation" attribute is presented
   in Section 5.5.

5.2.3.2.  Caller-ID Correlation Mechanism

   The Caller-ID correlation mechanisms consists of an exchange of the
   calling party number in E.164 format in SDP, followed by the
   availability of the Calling Party Number information element in the
   call setup signaling of the circuit switched connection.  If both
   pieces of information match, the circuit-switched bearer is
   correlated to the session described in SDP.

   Example of inclusion of E.164 number in the "cs-correlation"
   attribute is:





Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 11]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


      a=cs-correlation:callerid:+15551234

   The presence of the "callerid" sub-field indicates that the endpoint
   supports use of the calling party number as a means of correlating a
   PSTN call with the session being negotiated.  The "callerid" sub-
   field MAY be accompanied by the E.164 number of the party inserting
   the parameter.  For details on negotiating the correlation
   mechanisms, see Section 5.3.

      Note that there are no warranties that this correlation mechanism
      works or is even available, due a number of problems:



      *  The endpoint might not be aware of its own E.164 number, in
         which case it cannot populate the SDP appropriately.

      *  The Calling Party Number information element in the circuit-
         switched signaling might not be available, e.g., due to policy
         restrictions of the network operator or caller restriction due
         to privacy.

      *  The Calling Party Number information element in the circuit-
         switched signaling might be available, but the digit
         representation of the E.164 number might differ from the one
         expressed in the SDP.  For example, one can be represented in
         international format and the other might only contain the
         significant national digits.  To mitigate this problem
         implementations should consider only some of the rightmost
         digits from the E.164 number for correlation.  For example, the
         numbers +358-1-555-12345 and 01-555-12345 could be considered
         as the same number.  This is also the behavior of some cellular
         phones, which correlate the incoming calling party with a
         number stored in the phone book, for the purpose of displaying
         the caller's name.

5.2.3.3.  User-User Information Element Correlation Mechanism

   A second correlation mechanism is based on including in SDP a string
   that represents the User-User Information Element that is part of the
   call setup signaling of the circuit-switched bearer.  The User-User
   Information Element is specified in ITU-T Q.931 [ITU.Q931.1998] and
   3GPP TS 24.008 [3GPP.24.008], among others.  The User-User
   Information Element has a maximum size of 35 or 131 octets, depending
   on the actual message of the PSTN protocol where it is included.

   The mechanism works as follows: An endpoint creates a User-User
   Information Element, according to the requirements of the call setup



Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 12]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   signaling protocol.  The same value is included in the SDP offer or
   SDP answer, in a "cs-correlation:uuie" attribute.  When the SDP
   Offer/Answer exchange is completed, each endpoint has become aware of
   the value that will be used in the User-User Information Element of
   the call setup message of the PSTN protocol.  The endpoint that
   initiates the call setup attempt includes this value in the User-User
   Information Element.  The recipient of the call setup attempt can
   extract the User-User Information Element and correlate it with the
   value previously received in the SDP.  If both values match, then the
   call setup attempt corresponds to that indicated in the SDP.

   Note that, for correlation purposes, the value of the User-User
   Information Element is considered as a opaque string and only used
   for correlation purposes.  Typically call signaling protocols impose
   requirements on the creation of User-User Information Element for
   end-user protocol exchange.  The details regarding the generation of
   the User-User Information Element are outside the scope of this
   specification.

   Please note that there are no warranties that this correlation
   mechanism works.  On one side, policy restrictions might not make the
   User-User information available end to end in the PSTN.  On the other
   hand, the generation of the User-User Information Element is
   controlled by the PSTN circuit-switched call protocol, which might
   not offer enough freedom for generating different values from one
   endpoint to another one, or from one call to another in the same
   endpoint.  This might result in the same value of the User-User
   Information Element for all calls.

5.2.3.4.  DTMF Correlation Mechanism

   We introduce a third mechanism for correlating the circuit-switched
   bearer with the session described with SDP.  This is based on
   agreeing on a sequence of digits that are negotiated in the SDP
   Offer/Answer exchange and sent as Dual Tone Multifrequency (DTMF)
   tones over the circuit-switched bearer once this bearer is
   established.  If the DTMF digit sequence received through the
   circuit-switched bearer matches the digit string negotiated in the
   SDP, the circuit-switched bearer is correlated with the session
   described in the SDP.  The mechanism is similar to many voice
   conferencing systems which require the user to enter a PIN code using
   DTMF tones in order to be accepted in a voice conference.

   The mechanism works as follows: An endpoint selects a DTMF digit
   sequence.  The same sequence is included in the SDP offer or SDP
   answer, in a "cs-correlation:dtmf" attribute.  When the SDP Offer/
   Answer exchange is completed, each endpoint has become aware of the
   DTMF sequence that will be sent right after the circuit-switched



Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 13]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   bearer is set up.  The endpoint that initiates the call setup attempt
   sends the DTMF digits according to the procedures defined for the
   circuit-switched bearer technology used.  The recipient (passive side
   of the bearer setup) of the call setup attempt collects the digits
   and compares them with the value previously received in the SDP.  If
   the digits match, then the call setup attempt corresponds to that
   indicated in the SDP.

      Implementations are advised to select a number of DTMF digits that
      provide enough assurance that the call is related, but on the
      other hand do not prolong the bearer setup time unnecessarily.

   As an example, an endpoint willing to send DTMF tone sequence "14D*3"
   would include a "cs-correlation" attribute line as follows:

      a=cs-correlation:dtmf:14D*3

   If the endpoints successfully agree on the usage of the DTMF digit
   correlation mechanism, but the passive side does not receive any DTMF
   digits after successful circuit-switched bearer setup, or receives a
   set of DTMF digits that do not match the value of the "dtmf"
   attribute (including receving too many digits), the passive side
   SHOULD treat the circuit-switched bearer as not correlated to the
   ongoing session.

      DTMF digits can only be sent once the circuit-switched bearer is
      set up.  In order to suppress alerting for an incoming circuit-
      switched call, implementations may choose various mechanisms.  For
      example, alerting may be suppressed for a certain time period for
      incoming call attempts that originate from the number that was
      observed during the offer/answer negotiation.

5.3.  Negotiating the correlation mechanisms

   The three correlation mechanisms presented above (based on called
   party number, User-User Information Element and DTMF digit sending)
   are non-exclusive, and can be used independently of each other.

   In order to agree which correlation mechanisms are supported and used
   by each endpoint, we define a negotiation mechanism similar to the
   one defined for codec negotiation.  The sections below describe
   active/passive party determination and Offerer and Answerer behaviour
   for negotiating the correlation mechanisms.

5.3.1.  Determining the Direction of the Circuit-Switched Connection
        Setup

   In order to avoid a situation where both endpoints attempt to



Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 14]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   initiate a connection simultaneously, the direction in which the
   circuit-switched bearer is set up should be negotiated during the
   Offer/Answer exchange.

   The framework defined in RFC 4145 [RFC4145] allows the endpoints to
   agree which endpoint acts as the active endpoint when initiating a
   TCP connection.  While RFC 4145 [RFC4145] was originally designed for
   establishing TCP connections, it can be easily extrapolated to the
   connection establishment of circuit-switched bearers.  This
   specification uses the concepts specified in RFC 4145 [RFC4145] for
   agreeing on the direction of establishment of a circuit-switched
   bearer.

   RFC 4145 [RFC4145] defines two new attributes in SDP: "setup" and
   "connection".  The "setup" attribute indicates which of the endpoints
   should initiate the connection establishment of the PSTN circuit-
   switched bearer.  Four values are defined in Section 4 of RFC 4145
   [RFC4145]: "active", "passive", "actpass", "holdconn".  Please refer
   to Section 4 of RFC 4145 [RFC4145] for a detailed description of this
   attribute.

   The "connection" attribute indicates whether a new connection is
   needed or an existing connection is reused.  The attribute can take
   the values "new" or "existing".  Please refer to Section 5 of RFC
   4145 [RFC4145] for a detailed description of this attribute.

   Implementations according to this specification MUST support the
   "setup" and "connection" attributes specified in RFC 4145 [RFC4145],
   but applied to circuit-switched bearers in the PSTN.

   We define the active party as the one that initiates the circuit-
   switched call after the Offer/Answer process.  The passive party is
   the one receiving the circuit-switched call.  Either party may
   indicate its desire to become the active or passive party during the
   Offer/Answer exchange using the procedures described below.

   In order to establish a circuit-switched connection in the PSTN, the
   initiating endpoint needs to know the address (E.164 number) of the
   other endpoint.  Therefore, if an endpoint wants to be able to
   receive incoming circuit-switched calls (i.e., become the passive
   party), it must know its E.164 number and must indicate it in SDP.
   As a consequence, an endpoint that is not aware of its own E.164
   number cannot take the role of the passive side with respect the
   establishment of the circuit-switched connection.







Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 15]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


5.3.2.  Offerer behaviour

   When generating the Offer, If the Offerer supports any of the
   correlation mechanisms defined in this memo, it SHOULD include an
   attribute line "a=cs-correlation" in the SDP offer.  The "a=cs-
   correlation" line contains an enumeration of the correlation
   mechanisms supported by the Offerer, in the format of sub-fields.

   The current list of sub-fields include "callerid", "uuie" and "dtmf"
   and they refer to the correlation mechanisms defined in
   Section 5.2.3.2, Section 5.2.3.3, and Section 5.2.3.4, respectively.

   If the Offerer is only able to become the active party (for example
   because it doesn't know its E.164 address), the Offerer SHOULD add
   the "callerid", "uuie", and/or "dtmf" sub-fields but MUST NOT specify
   a value for those sub-fields.

   If the Offerer is able to become the passive party in the circuit-
   switched call setup, it SHOULD add values to all correlation
   mechanisms it supports:

   o  the E.164 number as the value in the "callerid" sub-field,

   o  the contents of the User-User information element as the value of
      the "uuie" sub-field, and

   o  the DTMF tone string as the value of the "dtmf" sub-field

   For example, if the Offerer is willing to use the User-User
   Information element and DTMF digit sending mechanisms, but can only
   become the active party, it includes the following line to the SDP:

      a=cs-correlation:uuie dtmf

   If, on the other hand, the Offerer is willing to use the User-User
   Information element and the DTMF correlation mechanisms, and is able
   to become the passive side, it includes to following line to the SDP:

      a=cs-correlation:uuie:2890W284hAT452612908awudfjang908 dtmf:14D*3

   When receiving the Answer, if the SDP does not contain "a=cs-
   correlation" attribute line, the Offerer should take that as an
   indication that the other party does not support or is not willing to
   use the procedures defined in the document for this session, and MUST
   revert to normal processing of SDP.

   When receiving the Answer, the Offerer MUST first determine whether
   it becomes the active or passive party, as described in Section



Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 16]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   Section 5.3.1.

   If the Offerer becomes the active party, it

   o  SHOULD extract the E.164 address from the "c=" line and SHOULD
      establish a circuit-switched call to that address.

   o  if the SDP Answer contained a value for the "uuie" sub-field,
      SHOULD send the User-User Information element according to the
      rules defined for the circuit-switched technology used, and set
      the value of the Information Element to that received in the SDP
      Answer,

   o  if the SDP Answer contained a value for the "dtmf" sub-field,
      SHOULD send those DTMF digits according to the circuit-switched
      technology used.

   If the Offerer becomes the passive party, it

   o  MUST be prepared to receive a circuit-switched call,

   o  MUST be prepared to receive and collect DTMF digits once the
      circuit-switched bearer is set up.  The Offerer SHOULD compare the
      received DTMF digits to the value of the "dtmf" sub-field.  If the
      received DTMF digits match the value of the "dtmf" sub-field in
      the "cs-correlation" attribute, the call SHOULD be treated as
      correlated to the ongoing session.

   o  MUST be prepared to receive a User-User Information element once
      the circuit-switched bearer is set up.  The Offerer SHOULD compare
      the received UUI to the value of the "uuie" sub-field.  If the
      value of the received UUI matches the value of the "uuie" sub-
      field, the call SHOULD be treated as correlated to the ongoing
      session.

5.3.3.  Answerer behaviour

   When receiving the Offer, the Answerer MUST first determine whether
   it becomes the active or passive party, as described in Section
   Section 5.3.1.

   If the SDP in the Offer indicates that the Offerer is only able to
   become the active party ("a=setup" line is set to "active", the
   Answerer needs to determine whether it is able to become the passive
   party.  If this is not possible e.g. due to the Answerer not knowing
   its E.164 address, the Answerer MUST NOT include "a=setup",
   "a=connection" or "a=cs-correlation" attributes in the Answer.




Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 17]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   When generating the answer, the Answerer SHOULD select those
   correlation mechanisms from the Offer it supports, and include an
   "a=cs-correlation" attribute line in the answer containing those
   mechanisms it supports.  The Answerer MUST NOT add any mechanisms
   which were not included in the offer.

   If the Answerer becomes the active party, it MUST NOT add parameter
   values to the "callerid", "uuie" or "dtmf" sub-fields.

   If the Answerer becomes the passive party, it MUST add values to the
   "callerid", "uuie" and/or "dtmf" sub-fields.

   After generating and sending the Answer, if the Answerer became the
   active party, it

   o  SHOULD extract the E.164 address from the "c=" line of the Offer
      and SHOULD establish a circuit-switched call to that address.

   o  if the SDP Offer contained a value for the "uuie" sub-field,
      SHOULD send the User-User Information element according to the
      rules defined for the circuit-switched technology used, and set
      the value of the Information Element to that received in the SDP
      Offer,

   o  if the SDP Offer contained a value for the "dtmf" sub-field,
      SHOULD send those DTMF digits according to the circuit-switched
      technology used

   If, on the other hand, the Answerer became the passive party, it

      MUST be prepared to receive a circuit-switched call,

      MUST be prepared to receive and collect DTMF digits once the
      circuit-switched bearer is set up.  The Answerer SHOULD compare
      the received DTMF digits to the value of the "dtmf" sub-field.  If
      the received DTMF digits match the value of the "dtmf" sub-field
      in the "cs-correlation" attribute, the call SHOULD be treated as
      correlated to the ongoing session.

      MUST be prepared to receive a User-User Information element once
      the circuit-switched bearer is set up.  The Answerer SHOULD
      compare the received UUI to the value of the "uuie" sub-field.  If
      the value of the received UUI matches the value of the "uuie" sub-
      field, the call SHOULD be treated as correlated to the ongoing
      session.






Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 18]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


5.3.4.  Considerations on successful correlation

   Note that, as stated above, it cannot be guaranteed that any given
   correlation mechanism will succeed even if the usage of those was
   agreed beforehand.  This is due to the fact that the correlation
   mechanisms require support from the circuit-switched bearer
   technology used.

   Therefore, even a single positive indication using any of these
   mechanisms SHOULD be interpreted by the passive endpoint so that the
   circuit-switched bearer establishment is related to the ongoing
   session, even if the other correlation mechanisms fail.

   If, after negotiating one or more correlation mechanisms in the SDP
   offer/answer exchange, an endpoint receives a circuit-switched call
   with no correlation information present, the endpoint has two
   choices: it can either treat the call as unrelated, or treat the call
   as related to the ongoing session in the IP domain.

   An endpoint may for example specify a time window after SDP offer/
   answer exchange during which received calls are treated as correlated
   even if the signaling in the circuit-switched domain does not carry
   any correlation information.  In this case, there is a chance that
   the call is erroneously treated as related to the ongoing session.

   An endpoint may also choose to always treat an incoming call as
   unrelated if the signaling in the circuit-switched domain does not
   carry any correlation information.  In this case, there is a chance
   that the call is erroneously treated as unrelated.

   Since, in these cases, no correlation information can be deduced from
   the signaling, it is up to the implementation to decide how to
   behave.  One option is also to let the user decide whether to accept
   the call as related, or to treat the call as unrelated.

5.4.  Considerations for Usage of Existing SDP

5.4.1.  Originator of the Session

   According to SDP [RFC4566], the origin line in SDP has the following
   syntax:

      o=<username> <sess-id> <sess-version> <nettype> <addrtype>
      <unicast-address>

   Of interest here are the <nettype> and <addrtype> fields, which
   indicate the type of network and type of address, respectively.
   Typically, this field carries the IP address of the originator of the



Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 19]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   session.  Even if the SDP was used to negotiate an audio or video
   media stream transported over a circuit-switched bearer, the
   originator is using SDP over an IP bearer.  Therefore, <nettype> and
   <addrtype> fields in the "o=" line should be populated with the IP
   address identifying the source of the signaling.

5.4.2.  Contact information

   SDP [RFC4566] defines the "p=" line which may include the phone
   number of the person reponsible for the conference.  Even though this
   line can carry a phone number, it is not suited for the purpose of
   defining a connection address for the media.  Therefore, we have
   selected to define the PSTN specific connection addresses in the "c="
   line.

5.5.  Formal Syntax

   The following is the formal Augmented Backus-Naur Form (ABNF)
   [RFC5234] syntax that supports the extensions defined in this
   specification.  The syntax is built above the SDP [RFC4566] grammar.
   Implementations according to this specification MUST be compliant
   with this syntax.

   Figure 2 shows the formal syntax of the extensions defined in this
   memo.


























Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 20]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


        ; extension to the connection field originally specified
        ; in RFC 4566

        connection-field   =  [%x63 "=" nettype SP addrtype SP
        connection-address CRLF]
        ;nettype and addrtype are defined in RFC 4566

        connection-address /=  e164-address / "-"
        e164-address       =  ["+"] 1*15DIGIT
        ; DIGIT is specified in RFC 5234

        ;subrules for correlation attribute
        attribute          /= cs-correlation-attr
        ; attribute defined in RFC 4566
        cs-correlation-attr= "cs-correlation:" corr-mechanisms
        corr-mechanisms    = corr-mech *(SP corr-mech)
        corr-mech          = caller-id-mech / uuie-mech / dtmf-mech / ext-mech
        caller-id-mech     = "callerid" [":" caller-id-value]
        caller-id-value    = ["+"] 1*DIGIT
        uuie-mech          = "uuie" [":" uuie-value]
        uuie-value         = 1*32(ALPHA/DIGIT)
        dtmf-mech          = "dtmf" [":" dtmf-value]
        dtmf-value         = 1*32(DIGIT / %x41-44 / %x23 / %x2A )
        ;0-9, A-D, '#' and '*'
        ext-mech           = ext-mech-name[":" ext-mech-value]
        ext-mech-name      = token
        ext-mech-value     = token
        ; token is specified in RFC4566

                  Figure 2: Syntax of the SDP extensions


6.  Example

                         Alice                               Bob
                         |                                  |
                         | (1) SDP Offer (PSTN audio)       |
                         |--------------------------------->|
                         |                                  |
                         | (2) SDP Answer (PSTN audio)      |
                         |<---------------------------------|
                         |                                  |
                         |   PSTN call setup                |
                         |<---------------------------------|
                         |                                  |
                         |<==== media over PSTN bearer ====>|
                         |                                  |




Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 21]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


                           Figure 3: Basic flow

   Figure 3 shows a basic example that describes a single audio media
   stream over a circuit-switched bearer.  The SDP offer is show in
   Figure 4.  The endpoint describes a PSTN circuit-switched bearer in
   the "m=" and "c=" line where it also indicates its E.164 number.
   Additionally, it expresses that it can initiate the circuit-switched
   connection or be the recipient of it.  The SDP offer also includes a
   correlation identifier that this endpoint will be inserting the User-
   User Information Element of the PSTN call setup if eventually this
   endpoint initiates the PSTN call.

           v=0
           o=jdoe 2890844526 2890842807 IN IP4 192.0.2.5
           s=
           t=0 0
           m=audio 9 PSTN -
           c=PSTN E164 +15551234
           a=setup:actpass
           a=connection:new
           a=cs-correlation:uuie:2890W284hAT452612908awudfjang908

                          Figure 4: SDP offer (1)


7.  IANA Considerations

   This document instructs IANA to register a number of SDP tokens
   according to the following data.

7.1.  Registration of new correlation SDP attribute

      Contact: Miguel Garcia <miguel.a.garcia@ericsson.com>

      Attribute name: cs-correlation

      Long-form attribute name: PSTN Correlation Identifier

      Type of attribute: media level only

      This attribute is subject to the charset attribute

      Description: This attribute provides the Correlation Identifier
      used in PSTN signaling

      Specification: RFC XXXX





Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 22]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


7.2.  Registration of a new "nettype" value

   This memo provides instructions to IANA to register a new "nettype"
   in the Session Description Protocol Parameters registry [1].  The
   registration data, according to RFC 4566 [RFC4566] follows.

   Type            SDP Name                     Reference
   ----            ------------------           ---------
   nettype         PSTN                         [RFCxxxx]

7.3.  Registration of new "addrtype" values

   This memo provides instructions to IANA to register a new "addrtype"
   in the Session Description Protocol Parameters registry [1].  The
   registration data, according to RFC 4566 [RFC4566] follows.

   Type            SDP Name                     Reference
   ----            ------------------           ---------
   addrtype        E164                         [RFCxxxx]
                   -                            [RFCxxxx]

7.4.  Registration of a new "proto" value

   This memo provides instructions to IANA to register a new "proto" in
   the Session Description Protocol Parameters registry [1].  The
   registration data, according to RFC 4566 [RFC4566] follows.

   Type            SDP Name                     Reference
   --------------  ---------------------------  ---------
   proto           PSTN                         [RFCxxxx]


8.  Security Considerations

   This document provides an extension on top of RFC 4566 [RFC4566], and
   RFC 3264 [RFC3264].  As such, the security considerations of those
   documents apply.

   This memo provides mechanisms to agree on a correlation identifier or
   identifiers that are used to evaluate whether an incoming circuit-
   switched call is related to an ongoing session in the IP domain.  If
   an attacker replicates the correlation identifer and establishes a
   call within the time window the receiving endpoint is expecting a
   call, the attacker may be able to hijack the circuit-switched call.
   These types of attacks are not specific to the mechanisms presented
   in this memo.  For example, caller ID spoofing is a well known attack
   in the PSTN.  Users are advised to use the same caution before
   revealing sensitive information as they would on any other phone



Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 23]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   call.  Furthermore, users are advised that mechanisms that may be in
   use in the IP domain for securing the media, like Secure RTP (SRTP)
   [RFC3711], are not available in the CS domain.


9.  Acknowledgments

   The authors want to thank Flemming Andreasen, Thomas Belling, John
   Elwell, Jari Mutikainen, Miikka Poikselka, Jonathan Rosenberg,
   Ingemar Johansson, Christer Holmberg, and Alf Heidermark for
   providing their insight and comments on this document.


10.  References

10.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC3108]  Kumar, R. and M. Mostafa, "Conventions for the use of the
              Session Description Protocol (SDP) for ATM Bearer
              Connections", RFC 3108, May 2001.

   [RFC3264]  Rosenberg, J. and H. Schulzrinne, "An Offer/Answer Model
              with Session Description Protocol (SDP)", RFC 3264,
              June 2002.

   [RFC4145]  Yon, D. and G. Camarillo, "TCP-Based Media Transport in
              the Session Description Protocol (SDP)", RFC 4145,
              September 2005.

   [RFC4566]  Handley, M., Jacobson, V., and C. Perkins, "SDP: Session
              Description Protocol", RFC 4566, July 2006.

   [RFC5234]  Crocker, D. and P. Overell, "Augmented BNF for Syntax
              Specifications: ABNF", STD 68, RFC 5234, January 2008.

10.2.  Informative References

   [3GPP.24.008]
              3GPP, "Mobile radio interface Layer 3 specification; Core
              network protocols; Stage 3", 3GPP TS 24.008 3.20.0,
              December 2005.

   [ITU.E164.1991]
              International Telecommunications Union, "The International
              Public Telecommunication Numbering Plan", ITU-



Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 24]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


              T Recommendation E.164, 1991.

   [ITU.Q931.1998]
              "Digital Subscriber Signalling System No. 1 (DSS 1) - ISDN
              User - Network Interface Layer 3 Specification for Basic
              Call Control", ISO Standard 9594-1, May 1998.

   [RFC3261]  Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston,
              A., Peterson, J., Sparks, R., Handley, M., and E.
              Schooler, "SIP: Session Initiation Protocol", RFC 3261,
              June 2002.

   [RFC3550]  Schulzrinne, H., Casner, S., Frederick, R., and V.
              Jacobson, "RTP: A Transport Protocol for Real-Time
              Applications", STD 64, RFC 3550, July 2003.

   [RFC3551]  Schulzrinne, H. and S. Casner, "RTP Profile for Audio and
              Video Conferences with Minimal Control", STD 65, RFC 3551,
              July 2003.

   [RFC3711]  Baugher, M., McGrew, D., Naslund, M., Carrara, E., and K.
              Norrman, "The Secure Real-time Transport Protocol (SRTP)",
              RFC 3711, March 2004.

   [RFC4975]  Campbell, B., Mahy, R., and C. Jennings, "The Message
              Session Relay Protocol (MSRP)", RFC 4975, September 2007.

URIs

   [1]  <http://www.iana.org/assignments/sdp-parameters>


Authors' Addresses

   Miguel A. Garcia-Martin
   Ericsson
   Calle Via de los Poblados 13
   Madrid, ES  28033
   Spain

   Email: miguel.a.garcia@ericsson.com










Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 25]

Internet-Draft    PSTN Circuit-Switched Bearers in SDP       August 2011


   Simo Veikkolainen
   Nokia
   P.O. Box 407
   NOKIA GROUP, FI  00045
   Finland

   Phone: +358 50 486 4463
   Email: simo.veikkolainen@nokia.com











































Garcia-Martin & Veikkolainen  Expires February 23, 2012        [Page 26]

